candy_store/app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
    def index
       @candy = Candy.all

SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 108], ["LIMIT", 1]]
---
    def show
        @candy = Candy.find(params[:id])

INSERT INTO "candies" ("name", "calories", "wrapper_color", "has_nuts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "butterscotch"], ["calories", 400], ["wrapper_color", "blue"], ["has_nuts", 1], ["created_at", "2020-10-30 02:28:10.874908"], ["updated_at", "2020-10-30 02:28:10.874908"]]
---
    def create
        candy = Candy.create(name: params[:name], calories: params[:calories], wrapper_color: params[:wrapper_color], has_nuts: params[:has_nuts])